{
  "welcome_title": "Welcome to my new website.",
  "home_content": {
    "welcomeTitle": "Welcome to my page.",
    "welcomeDescription": "This sample website is built with React and powered by Next.js. The content is managed through Firebase Remote Config, which means I can update things on the fly — no code changes or deployments needed.\nIt's simple, but I hope you’ll take a moment to explore it and maybe even take a peek at my playground while you're at it.",
    "aboutMeTitle": "The name is John. John Michael Suarez...",
    "aboutMeSubtitle": "but you can just call me JM 😎",
    "aboutMeDescription": "I'm a mobile application developer with a passion for web development — a curiosity that led me to create this page.\nI have hands-on experience with ReactJS, Next.js, Redux, and modern frontend workflows that I got from building and deploying responsive and user-friendly interfaces for several internal enterprise platforms.\nI'm also familiar with cloud services like Firebase and AWS, and have worked in Agile teams using tools like Git, Jira, and CI/CD pipelines.\nMy work emphasizes clean, maintainable code and intuitive user experiences, with a strong focus on frontend performance and usability.",
    "skillsList": ["ReactJS", "React Native", "Next.js", "Typescript", "Redux", "Context API", "Hooks", "Supabase", "Firebase", "Vercel"],
    "skillsDescription": "But words can only go so far right? I’m sure you want something a bit more concrete. Coincidentally, this sample website also happens to be my dumpsite... uh, I mean sandbox. It’s not perfect, but if you don’t mind a bit of a mess, feel free to take a look!"
  },
  "dump_site_content": {
        "sandboxTitle": "Sandbox",
        "sandboxDescription": "A space where I tinker with code, test new technologies, and turn random sparks of curiosity into working (and sometimes broken) prototypes.",
        "sandboxProjects": [
            {
              "title": "Phonebook",
              "description": "A basic phonebook application to showcase CRUD operations with Supabase.",
              "navigationTarget": "phonebook"
            },
            {
              "title": "Tic Tac Toe",
              "description": "Just a simple tic tac toe game.",
              "navigationTarget": "tictactoe"
            },
            {
              "title": "Authentication",
              "description": "Demonstrates a common login and registration flow using Firebase Authentication.",
              "navigationTarget": "authentication"
            }
        ]
  },
  "maintenance_content": {
        "maintenanceTitle": "🚧 Under Construction",
        "maintenanceDescription": "Sorry, this part is not ready yet. Please come back next time."
  }
}